Revit 2027 API
Leader.Anchor Property
 Anchor point of the Leader
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Anchor { get; }
Public ReadOnly Property Anchor As XYZ
	Get
public:
property XYZ^ Anchor {
	XYZ^ get ();
}
member Anchor : XYZ with get
Property Value
XYZ
Remarks
 Anchor is the leader's point that is attached to an annotation (a tag, note, etc.) This is a read-only property, for the this point gets always computed based on various properties of the annotation element.
See Also
Reference
Leader Class
Autodesk.Revit.DB Namespace